'''
1. Дан список повторяющихся элементов. Вернуть список с дублирующимися элементами. В результирующем списке не должно быть дубликатов.
2. В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых. Не учитывать знаки препинания и регистр символов. За основу возьмите любую статью из википедии или из документации к языку.
3. Создайте словарь со списком вещей для похода в качестве ключа и их массой в качестве значения. Определите какие вещи влезут в рюкзак передав его максимальную грузоподъёмность. Достаточно вернуть один допустимый вариант.*Верните все возможные варианты комплектации рюкзака.
'''
import string

a = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

text1 = 'Tekken 4 (яп. 鉄拳4 Тэккэ́н Фо:, «Железный кулак 4») — компьютерная игра в жанре файтинг, разработанная японской компанией Namco и выпущенная ей же для аркадных автоматов в июле 2001 года, после чего 28 марта 2002 года она была портирована на PlayStation 2; это четвёртая часть игровой серии Tekken и пятая игра в целом после выхода спин-оффа Tekken Tag Tournament (1999). После успеха предыдущей основной игры франшизы Tekken 3 (1997) разработчики захотели поэкспериментировать с новыми игровыми механиками и интерактивным окружением, чтобы дать серии новое дыхание. Tekken 4 стала первой игрой для PS2, которая поддерживала режим прогрессивной развёртки. Сюжет игры разворачивается спустя два года с момента окончания Tekken 3. Глава «Мисима Дзайбацу» и организатор международных бойцовских турниров «Король железного кулака» Хэйхати Мисима приобретает ДНК бога боевых искусств Огра, чтобы объединить его с собственным геномом и обрести бессмертие. Тело Хэйхати отвергает ДНК, из-за отсутствия необходимой генетической аномалии — дьявольского гена, после чего старший Мисима решает найти и захватить своего внука Дзина Кадзаму — носителя этого гена. Ситуация осложняется из-за возвращения сына Хэйхати и отца Дзина Кадзуи Мисимы, который стремится не только захватить власть в Дзайбацу, но и извлечь дьявольский ген сына, чтобы стать сильнее. Конфронтация трёх поколений семьи Мисима выливается в масштабное противостояние на четвёртом турнире «Король железного кулака», при участии сильнейших бойцов со всего мира. Tekken 4 получила преимущественно положительные отзывы от игровых журналистов, которые хвалили графику, звуковое сопровождение и более мрачный сюжет, но, в то же время, критиковали нововведения в игровом процессе и скудное разнообразие внутриигрового контента. Namco проделала работу над ошибками в сиквеле — Tekken 5, релиз которого состоялся в 2004 году.'

''' Словарь с количеством повторений каждого слова, оттуда вытаскиваем те, где количество больше 1'''

def repeatables (list1):
    uniques = list(set(list1))
    repetitions_dict = {}
    for unique in uniques:
        count = 0
        for item in list1:
            if unique == item:
                count += 1
        repetitions_dict.update({unique : count})
    repetitions = list(k for k, v in repetitions_dict.items() if v !=1)
    return repetitions

def replace_punctuation(text):
    for char in text:
        if char in string.punctuation:
            text = text.replace(char, " ")
    return text

def top_num_words (text, num):
    list1 = replace_punctuation(text).split(" ")
    uniques = list(set(list1))
    repetitions_dict = {}
    for unique in uniques:
        count = 0
        for item in list1:
            if unique == item:
                count += 1
        repetitions_dict.update({unique : count})
    repetitions = list(k for k, v in repetitions_dict.items() if v !=1)
    sorted_repetitions = sorted (repetitions_dict.items(), key=lambda x:x[1], reverse=True)
    return sorted_repetitions

print(repeatables(a))
      
print (top_num_words(text1, 10))                          